## READING A CSV DATASET FILE FROM THE LOCAL PATH AS A DATAFRAME

In [5]:
import pandas as pd

In [2]:
df2 = pd.read_csv("dataset_2.csv")     #reading and importing a dataset from local to the pandas Dataframe(here its taken df2)

In [3]:
df2                                           #to show the content of the dataset

,TransactionID,isFraud,TransactionDT,TransactionAmt,ProductCD,card1,card2,card3,card4,card5,...,V330,V331,V332,V333,V334,V335,V336,V337,V338,V339
0,2987000,0,86400,68.50,W,13926,NaN,150.0,discover,142.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2987001,0,86401,29.00,W,2755,404.0,150.0,mastercard,102.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2987002,0,86469,59.00,W,4663,490.0,150.0,visa,166.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2987003,0,86499,50.00,W,18132,567.0,150.0,mastercard,117.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2987004,0,86506,50.00,H,4497,514.0,150.0,mastercard,102.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
590535,3577535,0,15811047,49.00,W,6550,NaN,150.0,visa,226.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
590536,3577536,0,15811049,39.50,W,10444,225.0,150.0,mastercard,224.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
590537,3577537,0,15811079,30.95,W,12037,595.0,150.0,mastercard,224.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
590538,3577538,0,15811088,117.00,W,7826,481.0,150.0,mastercard,224.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
590539,3577539,0,15811131,279.95,W,15066,170.0,150.0,mastercard,102.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [71]:
df2['TransactionAmt'].max()

31937.391

In [4]:
df2['TransactionAmt'].max()   #accesing the highest transaction amt in the dataset by specifying that column label and max()

31937.391

In [5]:
df2['TransactionAmt'].min()   #same for minimum transaction amt in the dataset

0.251

In [6]:
df2['TransactionDT'][df2['card4']=='mastercard'].head(20) #it shows the transactiondt and the rowlabel in which mastercard is used
                                            #also dont forget to mention the card4 column in which types of cards are present

1     86401
3     86499
4     86506
9     86536
10    86549
11    86555
17    86668
20    86761
21    86769
23    86808
25    86944
28    86973
33    87078
49    87317
52    87333
53    87349
60    87581
62    87601
72    87752
76    87787
Name: TransactionDT, dtype: int64

In [7]:
df2['TransactionAmt'].mean()    #mean of Transactionamt column values

135.02717637293821

In [8]:
df2['TransactionAmt'].median()    #median of Transactionamt column values

68.769

In [9]:
df2.shape

(590540, 394)

## CREATING A DATAFRAME MANUALLY FROM THE DICTIONARY

In [10]:
amit_good = {'vidu':['langu', 'sangu', 'dangu', 'hangu'],
            'bhau':['tingu', 'jingu', 'mangu', 'yangu'],
            'khau':['mingu', 'lingu', 'gangu', 'ungu'],
            'hau':['dangu', 'bhangu', 'zangu', 'pingu']}         #random values and keys in a dictionary with list in it

In [11]:
df1 = pd.DataFrame(amit_good)  #creating a dataframe of the object(amit_good) by using pandas  (here dataframe object name df1)

In [12]:
df1              #to show the newly created dataframe with rows and columns

    vidu   bhau   khau     hau
0  langu  tingu  mingu   dangu
1  sangu  jingu  lingu  bhangu
2  dangu  mangu  gangu   zangu
3  hangu  yangu   ungu   pingu

## BASIC FUNCTIONS IN PANDAS

In [13]:
df1            #example dataset

    vidu   bhau   khau     hau
0  langu  tingu  mingu   dangu
1  sangu  jingu  lingu  bhangu
2  dangu  mangu  gangu   zangu
3  hangu  yangu   ungu   pingu

In [14]:
df1.shape            #shape will show the number of rows and columns present in the dataset respectively

(4, 4)

In [15]:
df1.head(2)     #head function will show the top few rows and columns if we specify head(number) or else head() accordingly

    vidu   bhau   khau     hau
0  langu  tingu  mingu   dangu
1  sangu  jingu  lingu  bhangu

In [16]:
df1.tail(2)          #tail will show the bottom rows and columns  of the dataframe

    vidu   bhau   khau    hau
2  dangu  mangu  gangu  zangu
3  hangu  yangu   ungu  pingu

In [17]:
df1[0:3]        #printing by indexing (in this case it will print 0 to 2 rows, excluding the last range always)

    vidu   bhau   khau     hau
0  langu  tingu  mingu   dangu
1  sangu  jingu  lingu  bhangu
2  dangu  mangu  gangu   zangu

In [18]:
df1.columns        #showing all the column names present in the dataset

Index(['vidu', 'bhau', 'khau', 'hau'], dtype='object')

In [19]:
df1.vidu       #to print a particular desired column( simply name it after df)

0    langu
1    sangu
2    dangu
3    hangu
Name: vidu, dtype: object

In [20]:
df1[['bhau','khau']]      #to print multiple columns specify the column names in a double list braces

    bhau   khau
0  tingu  mingu
1  jingu  lingu
2  mangu  gangu
3  yangu   ungu

## READING  ANOTHER CSV WITH SOME INTEGERS AND APPLYING FUNCTIONS IN IT

In [21]:
 df3 = pd.read_csv('Civil_Service_List__Active_.csv')

D:\ANACONDA\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (11,12,15,17,18,19) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [56]:
df3

,exam_no,list_no,first_name,mi,last_name,adj._fa,list_title_code,list_title_desc,group_no,list_agency_code,list_agency_desc,list_div_code,published_date,established_date,anniversary_date,extension_date,veteran_credit,parent_lgy_credit,sibling_lgy_credit,residency_credit
0,7012,765.0,CHOI,L,WONG,70.00,10015,ADMINISTRATIVE ENGINEER,0,0,OPEN COMPETITIVE,NaN,05/24/2017,12/27/2017,12/27/2021,NaN,NaN,NaN,NaN,NaN
1,7012,766.0,NARESH,K,MAHANGU,70.00,10015,ADMINISTRATIVE ENGINEER,0,0,OPEN COMPETITIVE,NaN,05/24/2017,12/27/2017,12/27/2021,NaN,NaN,NaN,NaN,NaN
2,7012,769.0,IAN,C,RAMOS,70.00,10015,ADMINISTRATIVE ENGINEER,0,0,OPEN COMPETITIVE,NaN,05/24/2017,12/27/2017,12/27/2021,NaN,NaN,NaN,NaN,NaN
3,7012,770.0,YANJUN,NaN,FENG,70.00,10015,ADMINISTRATIVE ENGINEER,0,0,OPEN COMPETITIVE,NaN,05/24/2017,12/27/2017,12/27/2021,NaN,NaN,NaN,NaN,NaN
4,7012,771.0,JIAJI,NaN,SHI,70.00,10015,ADMINISTRATIVE ENGINEER,0,0,OPEN COMPETITIVE,NaN,05/24/2017,12/27/2017,12/27/2021,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
517518,8000,35.0,BERNARD,E,POLITOSKI,72.15,92610,MACHINIST,0,0,OPEN COMPETITIVE,NaN,NaN,01/30/2019,01/30/2023,NaN,NaN,NaN,NaN,NaN
517519,8000,3.0,DEVINDRA,P,GOBARDHAN,95.72,92610,MACHINIST,0,0,OPEN COMPETITIVE,NaN,NaN,01/30/2019,01/30/2023,NaN,NaN,NaN,NaN,NaN
517520,8534,1.0,HEMCHAND,NaN,BHARASAIN,76.22,92610,MACHINIST,0,40,DEPARTMENT OF EDUCATION,NaN,NaN,01/30/2019,01/30/2023,NaN,NaN,NaN,NaN,NaN
517521,8534,1.0,LEIF,J,LAMBERTSON,92.53,92610,MACHINIST,0,826,DEPARTMENT OF ENVIRONMENTAL PROTECTION,NaN,NaN,01/30/2019,01/30/2023,NaN,NaN,NaN,NaN,NaN
517522,8534,1.0,NEIL,A,RIKKHI,92.61,92610,MACHINIST,0,841,DEPARTMENT OF TRANSPORTATION,NaN,NaN,01/30/2019,01/30/2023,NaN,NaN,NaN,NaN,NaN

In [23]:
df3.describe()

,Exam No,List No,Adj. FA,List Title Code,Group No,List Agency Code
count,517523.000000,517523.000000,517523.000000,517523.000000,517523.000000,517523.000000
mean,6175.633091,8628.222445,86.796815,62960.817556,0.006197,35.126505
std,1615.264328,14728.973447,8.595322,24425.569861,0.079357,170.707898
min,134.000000,0.500000,65.000000,10015.000000,0.000000,0.000000
25%,5001.000000,331.000000,80.000000,60817.000000,0.000000,0.000000
50%,6524.000000,1077.000000,87.500000,70210.000000,0.000000,0.000000
75%,7323.000000,9647.000000,93.570000,70811.000000,0.000000,0.000000
max,9602.000000,68720.000000,124.000000,92610.000000,5.000000,998.000000

In [55]:
df3['mi'].head(5)

0      L
1      K
2      C
3    NaN
4    NaN
Name: mi, dtype: object

In [38]:
#here in df3 dataframe the column names have spaces in it, so we cant call a column name directly, we have to convert it, strip it.

In [45]:
df3.columns = df3.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

In [62]:
df3['adj._fa'].max()

124.0

In [60]:
df3['exam_no'].min()

134

In [74]:
df3.index

RangeIndex(start=0, stop=517523, step=1)

## creating a dataframe from list of Tuples

In [2]:
import pandas as pd

In [7]:
weather_dat = [('amit', 59, 'rainy'),
              ('shamit', 88, 'sunny'),                   # random dataset created in which list contains 3 tuples
              ('games', 69, 'hazy')]
df5 = pd.DataFrame(weather_dat, columns=["day", "night", "evening"])   #in the line where we create the dataframe 
df5                                                                     # we can specify column names

      day  night evening
0    amit     59   rainy
1  shamit     88   sunny
2   games     69    hazy

## CREATING A DATFRAME FROM THE LIST OF DICTIONARIES

In [10]:
amit_dat = [
    {'good':'shot', 'bad':'shot', 'worst':'shot'}   #one dictionary is present in the list with (columnname:values) format
]
df9 = pd.DataFrame(amit_dat)        
df9

   good   bad worst
0  shot  shot  shot